from django.core.management.base import BaseCommand
from django.contrib.auth import get_user_model
from django.db.models import Q
from django.utils import timezone

from events.models import Event, Tag, City
from random import choice, randint
from faker import Faker

fake = Faker('uk_UA')

events = [{'name': 'ОЛЕКСАНДР ПОЛОЖИНСЬКИЙ. КОНЦЕРТ В ДЕНЬ НАРОДЖЕННЯ',
           'description': f'ОСНОВОЮ КОНЦЕРТНОЇ ПРОГРАМИ СТАНУТЬ ПІСНІ З ДВОХ ДУЕТНИХ АЛЬБОМІВ ГУРТУ ТАРТАК - «СИСТЕМА НЕРВІВ» ТА «АНТАРТАКТИДА. ЧАСТИНА ПЕРША»'
                          'Також будуть виконані деякі пісні з альбому «Тартак - Гуляйгород», з репертуару дуету Ол.Ів.ʼЄ та з сольного альбому Олександра Положинського «Попри Все».Мабуть, найбільш очікуваними будуть пісні «Понад Хмарами» з Катею Chilly, «Ні Я Не Ту Кохав» з автором пісні, одним із учасників дуету Світязь, Анатолієм Говорадлом та «Не Кажучи Нікому» з Андрієм Підлужним.'
                          'Повний список учасників та пісень можна побачити на афіші концерту, але можливі також і приємні несподіванки.'
                          'Варто також зазначити, що Андрій Підлужний та Віталій Кириченко з Нумер 482 - діючі військовослужбовці, але будемо сподіватися, що їм вдасться, за підтримки командування, виступити в цьому концерті.',
           'img': 'events/polozinskiy.webp', 'price': 575, 'location_info': 'Docker Pub. вул. Богатирська, 25',
           'city': 'Київ', 'tags': ['Концерти']},
          {'name': 'KOZAK SYSTEM. ЛЮДИ-ТИТАНИ. ВЕЛИКИЙ СОЛЬНИЙ КОНЦЕРТ',
           'description': f"КОZAK SYSTEM готуються об'єднати 10 000 українців у великому сольному концерті 9 листопада 2024 року в столичному Палаці Спорту."
                          "Їхні концерти - це не лише музика, але й просвітницька місія, єднання та морально-психологічна підтримка наших воїнів. За два роки повномасштабної війни гурт проїхав усю країну, обʼєднуючи та мотивуючи мільйони українців. Їхня музика лунала не лише на великих концертних майданчиках, а й стала пульсуючим серцем кожного міста, села та містечка. Філармонії, театри, площі, располаги військових, бомбосховища,зали вокзалів, сходи маленьких сільських бібліотек - кордонів між музикантами та глядачами не було й не буде."
                          "Промови Івана Леньо - не просто музиканта, а й лідера думок сучасної України, надихають та заряджають кожного присутнього енергією та вірою у Перемогу. Кожна пісня - це не тільки музика, це - голос нації, яка бореться за свою Свободу. Вогникі телефонів, що спалахують під час виконання «Біля тополі», створюють магічну атмосферу надії та віри. Виконуючи «А до Херсона повернулася весна», гурт незмінно викликає на сцену мешканців тимчасово окупованих територій, під час «Азов-сталі» на сцену виходять близькі незламних борців за Маріуполь, коли лунають «Люди-Титани» - пісня-присвята пораненим воїнам, весь зал затамовує подих, або ж скандує слова «Маніфесту», вказуючи напрямок руху російського воєнного корабля, а багатоголосся глядачів та музикантів під «Українське сонце» вже стало символом нашої сили та незламності."
                          "Великий сольний концерт гурту в Палаці Спорту стане своєрідною «крапкою з комою» у цьому етапі творчого життя KOZAK SYSTEM, квінтесенцією усіх 300 концертів за ці два роки з початку повномасштабної війни. Цей концерт - не просто подія в культурному житті країни. Це величезна хвиля єднання, що сколихне кожного українця, надихаючи на нові звершення. Запрошуємо всіх, хто хоча би раз відчував потужну енергію їхніх живих концертів, приєднатися до цієї масштабної події та разом відчути силу об'єднання в ім'я Перемоги України.",
           'img': 'events/kozak.webp','price': 250, 'location_info': 'Палац спорту. Пл. Спортивна, 1', 'city': 'Київ', 'tags': ['Концерти']},
          {'name': 'ФІОЛЕТ. ПІСНІ СЕРЕДНЬОЇ ТЯЖКОСТІ',
           'description': 'Подія "Фіолет. Пісні середньої тяжкості" у Києві відбудеться на локації Культ Мотив.',
           'img': 'events/fiolet.webp','price': 450, 'location_info': 'Культ Мотив, вулиця Спаська, 36/31', 'city': 'Київ', 'tags': ['Концерти']},
          {'name': 'КРИХІТКА',
           'description': f'Київський гурт Крихітка – родоначальники вітчизняного фем-інді-попу з багатотисячною армією шанувальників. Незмінною фронтвумен колективу є композиторка, співачка та журналістка Олександра Кольцова. Сьогодні артистка вважає однією з головних місій свого гурту, як і інших творчих формацій в Україні, «тлумачити світу нашу культуру». І мистецький політ Крихітки у цьому напрямку – нескінченний',
           'img': 'events/krihitka.webp','price': 700, 'location_info': 'вул. Січових Стрільців 37-41', 'city': 'Київ', 'tags': ['Концерти']},
          {'name': 'САША ЧЕМЕРОВ',
           'description': f'Відомий рок-музикант, засновник таких популярних гуртів як Димна Суміш, The Gitas , успішний музичний продюсер, автор, виконавець Саша Чемеров дасть сольний концерт в Києві в Docker Pub.'
                          'Ви почуєте давно відомі та рідні вам пісні. Серед яких «В країні ілюзій», «Мама», «Піхота», feat з гуртом Бумбокс «Любила», «Біжи тікай», що записана у дуеті з Христиною Соловій та інші.'
                          'До того ж, зі сцени пролунають нові треки, які вже встигли полюбитися українцям. Наприклад, «Білгород» від Культурного десанту разом з Кольою Сєргою та Мішою Крупіним, а також нещодавній feat з Мішою Правильним «Обійми».',
           'img': 'events/chemerov.webp','price': 675, 'location_info': 'вул. Богатирська, 25', 'city': 'Київ', 'tags': ['Концерти']},
          {'name': 'KOLA',
           'description': f'Співачка KOLA сьогодні є справжнім голосом української незламності. Її пісні стають надійною емоційною опорою для слухачів. Популярні композиції у виконанні KOLA завжди впізнають і знають напам’ять. Нові треки співачки привертають увагу аудиторії ще до офіційної презентації завдяки сніпетам в інстраграм. Виступи талановитої виконавиці збирають повні зали, пісні отримують нагороди та стають саундтреками. Так композиція «Цінувати життя» стала супроводом до серіалу, в якому розкриваються реалії життя під час повномасштабного вторгнення.',
           'img': 'events/kola.webp','price': 550, 'location_info': 'Пл. Спортивна, 1', 'city': 'Київ', 'tags': ['Концерти']},
          {'name': 'LATEXFAUNA В KURENI',
           'description': f"Будь ласка, не рукоблудьте зараз. Притримайте гормони в ім’я служінню розпусті 9 червня о 19:00 на проповіді Latexfauna в Куренях."
                          "Будьте там хтиві, браття і сестри. Будьте вільні в своїх бажаннях, сійте й пожинайте чил та вайб, що дарував нам Космос. Для вас мовитимуть притчі про Лайм, про Дослідницю, псалми про Масандру й Черкащину, молитви за Серфера й Кентавра."
                          "Відкрийте свої серця пречистій Латексфауні й будьте хот віднині й повсякчас."
                          "Омінь❤️",
           'img': 'events/latexfauna.webp','price': 1500, 'location_info': 'Паркова дорога, 4', 'city': 'Київ', 'tags': ['Концерти']},
          {'name': 'KARNA - ПРЕЗЕНТАЦІЯ НОВОГО АЛЬБОМУ',
           'description': 'Гуцул-металісти Karna вирушають в тур із презентацією нового альбому!'
                          'Діти Карпат, поціловані самим Перуном, мольфарська магія яких стрімкими арканами розноситься горами і полонинами.'
                          'Усі ми встигли несамовито скучити за цими гарячими гуцулами, за романтичними композиціями в яких сплітаються пристрасть і ніжність, за автентичними мотивами та, чого вже приховувати – за шаленими паті на Прикарпатті, які навіть чорти не обходять стороною. ',
           'img': 'events/karna.webp','price': 590, 'location_info': 'вул. Шота Руставелі, 16А', 'city': 'Київ', 'tags': ['Концерти']},
          {'name': 'SHUMEI НА V’YAVA В САДУ БАЖАНЬ',
           'description': 'SHUMEI (Олег Шумей) – один з найперспективніших представників нової хвилі українських виконавців. Володар неповторного голосу та безмежної харизми він вперше став відомим після виконання кавера на композицію «Біля Тополі» гурту Enej. Цей кліп на сьогодні вже переглянули 24 мільйони користувачів. Зараз у репертуарі SHUMEI – спільні треки, записані в дуетах з Артемом Пивоваровим та Златою Огнєвіч. А нещодавно Олега вибрала для спільного виконання пісні «Стерва» Тіна Кароль (робота зібрала 1,2 млн прослуховувань на Youtube протягом 6 днів).',
           'img': 'events/Shumei.webp','price': 600, 'location_info': ' пр. Глушкова, 1', 'city': 'Київ', 'tags': ['Концерти']},
          {'name': 'ДІТИ ІНЖЕНЕРІВ. ТУР-2024 НА ПІДТРИМКУ ЗСУ!',
           'description': "Вже цієї весни 4 благодійні концерти гурту діти інженерів. Серце зігрівається, бо анонсуємо такі події!"
                          "Діти інженерів, квіти інтер'єрів, спадкоємці винахідників... Можна продовжувати пошуки синонімів, аби описати цей гурт, але який в тому сенс, якщо ви гарно розумієте про кого мова. Як їх не назви, це або один з ваших найулюбленіших гуртів, або гурт, про який ви стовідсотково чули та який вам точно сподобається.",
           'img': 'events/child.webp','price': 590, 'location_info': ' вул. Січових Стрільців 37-41', 'city': 'Київ',
           'tags': ['Концерти', 'Благодійність']},
          {'name': 'KLAVDIA PETRIVNA',
           'description': "Звісно, перше шоу увійде в історію. Це справжній ексклюзив, на який ви ще можете встигнути потрапити – ловіть останні квитки."
                          "Без сумнівів, всі квитки на концерт 31.08 буде продано задовго до закінчення літа. Зараз у вас є шанс обрати кращі місця в секторах чи у першій «фанці», щоб зануритись в творчість артистки разом з повною залою однодумців."
                          "Klavdia Petrivna нещодавно виступила на концертах Артема Пивоварова, де вони разом представили пісню «Барабан». Робота вже отримала мільйони прослуховувань і переглядів, піднялась на першу сходинку Топ-100 Україна в Apple Music, на третю – в Top 50 (Україна) в Spotify, на перше місце в трендах українських кліпів на YouTube."
                          "Музична сенсація Klavdia Petrivna залишається анонімною і продовжує творити справжню музичну революцію в шоу-бізнесі. Приходьте на її концерт познайомитись, стати учасниками шоу і наживо послухати треки, які за дуже короткий час підкорили серця мільйонів."
                          "Заходи матимуть благодійний характер, частинуа коштів буде спрямована на потреби Захисників та Захисниць України.",
           'img': 'events/klavdia.webp','price': 675, 'location_info': 'Пл. Спортивна, 1', 'city': 'Київ', 'tags': ['Концерти', 'Благодійність']},
          {'name': 'ОДИН В КАНОЕ',
           'description': '«Добрих новин чекати — невдячна справа». Але вже незабаром ви матимете нагоду почути музику Один в каное у своєму рідному місті. «Бути собою»: радіти та сумувати, плакати та сміятись — все це ви зможете робити на нашому концерті.'
                          'Почути живе виконання «Один в полі воїн», «Човен», «У мене немає дому» та інших пісень, які допомагають усім нам впоратись з емоційними викликами нашого воєнного сьогодення. Також, разом з Один в каное, ви зможете доєднатись до збору на катери для Головного управління розвідки Міністерства оборони України.'
                          'Разом до перемоги!',
           'img': 'events/Odynvkanoelogo.webp','price': 1000, 'location_info': 'Алея Героїв Небесної Сотні, 1', 'city': 'Київ', 'tags': ['Концерти']},
          {'name': 'СУСІДИ СТЕРПЛЯТЬ',
           'description': "Подія СУСІДИ СТЕРПЛЯТЬ  у Харкові відбудеться 2024-06-14 в 18:30 на локації Казка Bar."
                          "Ви можете зручно придбати квитки на СУСІДИ СТЕРПЛЯТЬ  на Concert.ua онлайн."
                          "Ого, Сусіди Стерплять вирушають у благодійний тур?! "
                          "Унікальна музична формація, яка зʼявилася з великого вибуху дофаміну і вкиду окситоцину прямує в тур містами України з презентацією нового альбому!"
                          "Дует, який однаково вправно міксує контроверсійні емоції та жанри, створюючи унікальний музичний коктейль, який стане до смаку навіть справжнім музичним гурманам. ",
           'img': 'events/susidu.webp','price': 390, 'location_info': 'Пушкінська, 25', 'city': 'Харків', 'tags': ['Концерти']},
          {'name': 'ROHATA ZHABA',
           'description': 'Нарешті можна скинути свої людські подоби і прямувати за теплим травневим вітром до нашого вогнику, де ми розповідатимемо химерні сни, що наснились Жабі під час зимової сплячки. ',
           'img': 'events/rohata.webp','price': 390, 'location_info': 'пр-т Коцюбинського, 39', 'city': 'Вінниця', 'tags': ['Концерти']},
          {'name': "МУР. ПРЕМ'ЄРА РЕП-МЮЗИКЛУ ТИ [РОМАНТИКА]",
           'description': '«Ти [Романтика]» – вистава, для створення якої використовувалися матеріали однойменного альбому МУР. Робота отримала великий культурний резонанс, про неї писали BBC, Forbes та Vogue. Директорка «Мистецького арсеналу» Олеся Островська назвала мюзикл «популярною культурою, про яку мріяли з часів Винниченка», літературознавець Ростислав Семків лаконічно охрестив альбом «геніальним». Грандіозним, талановитим, пронизливим, таким, що справив найсильніше враження, назвав МУР засновник FEDORIV Group Андрій Федорів. І ви маєте це побачити!',
           'img': 'events/romantika.webp','price': 450, 'location_info': ' вул. Театральна, 13', 'city': 'Вінниця', 'tags': ['Концерти']},
          {'name': "ГУРТ МОТОР'РОЛЛА",
           'description': 'В травні гурту виповнюється 30 років, тож у вас буде можливість привітати хлопців з Ювілеєм! Починаючи з творчості у жанрі рокабіллі-хард-кору, у період «нульових» гурт Мотор’ролла закріпив за собою звання яскравих представників якісної української рок-альтернативи завдяки альбомам «…шо кому не ясно?» та «Кольорові сни». Рок-група була створена у Хмельницькому, і зараз музиканти – жадані гості сцен по всій Україні.',
           'img': 'events/motorola.webp','price': 200, 'location_info': 'пр-т Коцюбинського, 39', 'city': 'Вінниця', 'tags': ['Концерти']},
          {'name': 'ТНМК. JAZZY',
           'img': 'events/tnmk.webp','description': 'Історія цього проєкту сягає 1997 року, коли ТНМК спробували розширити свою фанкову музику за допомогою несподіваних джазових аранжувань. Ви почуєте найкращі хіти гурту в абсолютно новому звучанні!',
           'price': 390, 'location_info': 'вул. Старознесенська, 24-26', 'city': 'Львів', 'tags': ['Концерти']},
          {'name': 'СКАЙ',
           'description': "Нові мелодії, Легендарні Хіти та Безкрайні Враження!"
                          "Запрошуємо вас приєднатися до нас у захоплюючому весняному турі гурту Скай, що обіцяє принести море музичних емоцій та вразити новими звучаннями.",
           'img': 'events/sky.webp','price': 400, 'location_info': 'вул. Старознесенська 24-26', 'city': 'Львів', 'tags': ['Концерти']},
          {'name': 'ОКЕАН ЕЛЬЗИ. СВІТОВИЙ ТУР 2025',
           'description': '14 червня легендарний гурт Океан Ельзи – з великим концертом на стадіоні Металіст! На всіх чекає масштабний виступ улюбленої команди й презентація десятого альбому. ОЕ навесні розпочнуть світовий концертний тур, завдяки якому їхні пісні почують на кількох континентах. Але першими насолодитися новими піснями та хітами кумирів зможете саме ви.Замовити квитки можна вже сьогодні',
           'img': 'events/oe.webp','price': 350, 'location_info': 'вул. Плеханівська, 65', 'city': 'Харків', 'tags': ['Концерти']},
          {'name': 'Сергій Жадан',
           'description': 'Дорогі брати і сестри, з великою радістю повідомляю, що 25-го травня наступного року в київському палаці спорту відбудеться мій великий поетичний вечір «Усі вірші». Формально це буде презентація повного однотомного (на 1400 сторінок) зібрання моїх віршів, яке вийде у січні у видавництві Meridian Czernowitz. Неформально - ми з командою вперше в',
           'img': 'events/s.webp','price': 560, 'location_info': 'Київський Палац Спорту', 'city': 'Київ', 'tags': ['Літературний вечір']},
          {'name': 'Політично ненадійний',
           'description': "Жоден вогонь, жоден вогонь не горить так гаряче, як таємне кохання, про яке ніхто не знає Іван Франко Вистава про любов... тугу... політику... розлуку.. Україну... пристрасть... зраду... про важкий вибір... про смерть... небуття... відчай... Про Івана Франка, такого якого не вчать в школах і університетах, такого яким він був.",
           'price': 200, 'location_info': 'Центр Театрального Мистецтва ім. Леся Курбаса', 'city': 'Житомир',
           'img': 'events/politnenad.webp','tags': ['Літературний вечір']},
          {'name': 'Галерея «Бастіон»',
           'description': 'Сувенірна галерея «Бастіон» включає в себе ресторан, кав’ярню, магазин вишуканих вин, магазини оптики, швейцарських годинників, парфумерно-косметичний бутік, інші крамниці товарів сувенірно-подарункової групи та постійно діючу виставку картин та фотографій.',
           'img': 'events/bastion.webp','price': 50, 'location_info': 'пр. Фортечний, 1', 'city': 'Івано-Франківськ', 'tags': ['Виставки']},
          {'name': 'DALI.DIGITAL - ГАЛЕРЕЯ ЖИВИХ КАРТИН В UNIVERSUM HALL',
           'description': 'Після майже двохрічної перерви відома в Україні та за її межами галерея живих картин відкриває свої двері в Universum Hall на ВДНГ. Відреставровані історична циклорама 6-го павільйону, в колишньому кінотеатрі "Прогрес", площею 69 м2 "оживає" шедеврами образотворчого мистецтва.',
           'price': 350, 'location_info': 'пр.Академіка Глушкова, 1 ВДНГ, павільйон №6', 'city': 'Київ',
           'img': 'events/dali.webp','tags': ['Виставки']},
          {'name': 'СТЕНДАП ІМПРОВІЗАЦІЯ АЛЛИ ВОЛКОВОЇ',
           'description': 'СТЕНДАП ІМПРОВІЗАЦІЯ АЛЛИ ВОЛКОВОЇ',
           'price': 450, 'location_info': 'вул. Б.Хмельницького, 1', 'city': 'Луцьк',
           'img': 'events/alla.webp','tags': ['Стендап', 'Благодійність']},
          {'name': 'ВЕЛИКИЙ СТЕНДАП КОНЦЕРТ',
           'description': 'Великий  Стендап - це  івент, який обіцяє вам незабутній досвід сміху і розваг! Це місце, де досвідчені стендап-коміки зберуться, щоб розірвати зал сміхом і зарядити вас позитивною енергією.',
           'img': 'events/bigStendup.webp','price': 200, 'location_info': 'Саксаганського, 6', 'city': 'Київ', 'tags': ['Стендап']},
          {'name': 'ІМПРОВІЗАЦІЯ: ВЕТЕРАНИ КОСМІЧНИХ ВІЙСЬК ТА ІГОР ЛАСТОЧКІН',
           'description': '«Імпровізація» – це благодійний гумористичний концерт команди «Ветерани космічних військ» та Ігоря Ласточкіна. «ВКВ» у складі неперевершених Курана, Вені і Дамницького запам’яталися українському глядачеві дотепними та нестандартними виступами в проєкті «Ліга сміху». Команда стала чемпіоном 5-го сезону конкурсу. Ігор Ласточкін – справжній гуру української гумористичної сцени, капітан команди «Збірна Дніпра», тренер «Ліги сміху», ведучий «Розсміши коміка», учасник інших популярних телепроєктів.',
           'img': 'events/improvisa.webp','price': 400, 'location_info': 'Проспект Любомира Гузара, 1', 'city': 'Київ', 'tags': ['Стендап']},
          {'name': 'Бігові тренування від Track&Speed Club',
           'description': 'Тут тренуються як новачки, так і досвідченні бігуни. Ми бігаємо спринт, середні дистанції, заглядаємо на трейли, орієнтування, півмарафони, а буває і на марафони.',
           'img': 'events/run.webp','price': 800, 'location_info': 'Труханів острів', 'city': 'Київ', 'tags': ['Спортивні заходи']},
          {'name': 'Безплатні тренування з бадмінтону',
           'description': '13 тренувань з бадмінтону з професійними інструкторами у рамках заходу «Здорова молодь - здорова нація». Приєднуйтесь',
           'img': 'events/badminton.webp','price': 0, 'location_info': 'вул. Кіото, 25', 'city': 'Київ',
           'tags': ['Спортивні заходи', 'Благодійність']},
          {'name': 'Скандинавська ходьба',
           'description': 'Безкоштовні заняття зі скандинавської ходьби для всіх бажаючих. ', 'price': 50,
           'img': 'events/skandin.webp','location_info': 'просп. Червоної Калини', 'city': 'Київ', 'tags': ['Спортивні заходи']},
          {'name': 'Дніпрові кручі: Трипілля, Витачів, Ржищів',
           'description': 'Дніпрові кручі: Трипілля, Витачів, Ржищів',
           'img': 'events/dnipro.webp','price': 990, 'location_info': 'Ржищів', 'city': 'Ржищів', 'tags': ['Туристичні екскурсії']},
          {'name': 'В гості до Галаганів: Сокиринці, Прилуки, Густиня',
           'description': 'В гості до Галаганів: Сокиринці, Прилуки, Густиня',
           'img': 'events/gosti.webp','price': 1150, 'location_info': 'Сокиринці', 'city': 'Прилуки', 'tags': ['Туристичні екскурсії']},
          {'name': 'Відпочинок у каньйоні', 'description': 'Відпочинок у каньйоні',
           'img': 'events/kanion.webp','price': 990, 'location_info': 'Каньйон', 'city': 'Обухів', 'tags': ['Туристичні екскурсії']},
          {'name': 'Незвичайний день у Маліївцях', 'description': 'Незвичайний день у Маліївцях',
           'price': 2280, 'location_info': 'Маліївці', 'city': "Кам'янець-Подільський",
           'img': 'events/maliivsi.webp','tags': ['Туристичні екскурсії']},
          {'name': 'ВІДКРИТИЙ МІКРОФОН',
           'description': 'Подія "Відкритий мікрофон" у Києві відбудеться 2024-01-22 в 18:30 на локації Underground Standup Club.',
           'img': 'events/open.webp','price': 150, 'location_info': 'вул. Золотоворітська, 15', 'city': 'Київ', 'tags': ['Відкриті мікрофони']},
          ]


class Command(BaseCommand):
    help = 'Seed random events'

    def handle(self, *args, **kwargs):
        try:
            users = get_user_model().objects.filter(
                Q(is_staff=True) | Q(is_superuser=True) | Q(is_content_maker=True)
            )
            cities = City.objects.all()
            tags = list(Tag.objects.all())
            if not tags:
                self.stdout.write(self.style.ERROR(
                    "Немає жодного тегу для використання. Будь ласка, створіть деякі теги перед виконанням цієї команди."))
                return
            for event_data in events:
                user = choice(users)
                city = choice(cities)

                event = Event(
                    name=event_data['name'],
                    description=event_data['description'],
                    price=event_data['price'],
                    time=timezone.make_aware(fake.future_datetime(end_date='+10d')),
                    creator=user,
                    image=event_data['img'] if event_data['city'] else f'events/test_event.webp',
                    location_info=event_data['location_info'],
                    city=City.objects.get(name=event_data['city']),
                )
                event.full_clean()
                event.save()

                event.tags.add(*[Tag.objects.get(name=i).id for i in event_data['tags']])
                event.save()
            self.stdout.write(self.style.SUCCESS("Події успішно створені!"))
        except Exception as e:
            self.stdout.write(self.style.ERROR(f"Помилка: {e}. Події не створені"))
