from django.core.management.base import BaseCommand
from django.contrib.auth import get_user_model
from faker import Faker

from users.models import ContentMakerRequest
from random import choice

fake = Faker('uk_UA')

content_maker_requests_list = ["Прошу надати мені права контент-мейкера для творчого процесу.",
                               "Прошу надати права контент-мейкера для створення та редагування контенту.",
                               "Будь ласка, дайте мені можливість створювати контент як контент-мейкер.",
                               "Хочу отримати права контент-мейкера для розвитку сайту через новий контент.",
                               "Прошу надати мені доступ до функцій контент-мейкера для покращення вмісту.",
                               "Прошу видати мені права контент-мейкера для додавання свіжого контенту.",
                               "Прошу надати мені можливість створювати та публікувати власний контент.",
                               "Будь ласка, дайте мені права контент-мейкера для активного внесення у контент.",
                               "Хочу отримати права контент-мейкера для редагування та оптимізації контенту.",
                               "Прошу надати мені доступ до функцій контент-мейкера для збагачення сайту новим матеріалом.",
                               "Прошу надати мені права контент-мейкера для додавання корисного та цікавого контенту.",
                               "Прошу надати мені можливість створювати контент як активний учасник веб-спільноти.",
                               "Будь ласка, дайте мені права контент-мейкера для розвитку сайту через якісний контент.",
                               "Хочу отримати права контент-мейкера для публікації важливої та актуальної інформації.",
                               "Прошу надати мені доступ до функцій контент-мейкера для залучення більшої аудиторії.",
                               "Прошу видати мені права контент-мейкера для створення унікального та цікавого контенту.",
                               "Прошу надати мені можливість створювати контент для підвищення інтересу до сайту.",
                               "Будь ласка, дайте мені права контент-мейкера для розширення тематики та обговорення новин.",
                               "Хочу отримати права контент-мейкера для привертання уваги до ключових тем сайту.",
                               "Прошу надати мені доступ до функцій контент-мейкера для підтримки активності веб-спільноти."]


class Command(BaseCommand):
    help = 'Seed random content maker requests'

    def handle(self, *args, **kwargs):
        try:
            users = get_user_model().objects.all()
            for _ in range(20):
                user = choice(users)
                request = ContentMakerRequest(
                    user=user,
                    is_approved=choice([True, False]),
                    text=choice(content_maker_requests_list)
                )
                request.full_clean()
                request.save()
            self.stdout.write(self.style.SUCCESS("Запити на отримання ролі контентмейкера успішно створені!"))
        except Exception as e:
            self.stdout.write(self.style.ERROR(f"Помилка: {e}. Запити на отримання ролі контентмейкера не створені"))
