from django.core.management.base import BaseCommand
from django.contrib.auth import get_user_model
from faker import Faker

from users.models import IssueRequest
from random import choice

fake = Faker('uk_UA')

issues_list = [
    "Шановний Джейсон, Я хочу звернути вашу увагу на деякі проблеми, які наші користувачі повідомляють нам стосовно роботи нашого сайту. Ось декілька основних аспектів, на які вони звертають увагу: Перш за все, багато користувачів стикаються з проблемами під час реєстрації та входу на сайт. Це може включати в себе труднощі з правильним введенням електронної пошти або пароля, а також можливість отримання повідомлень про заблокований обліковий запис. Деякі користувачі також відзначають, що вони затруднюються в пошуку потрібної інформації на сайті або в загальному пересуванні по ньому. Це може свідчити про необхідність переглянути структуру сайту та покращити навігаційні можливості. Деякі функції сайту можуть не працювати належним чином або призводити до непередбачуваних помилок під час виконання певних операцій, таких як додавання товарів до кошика або оформлення замовлення. Нарешті, деякі користувачі відзначають повільну роботу сайту, що може призводити до незручностей та втрати часу.",
    "Шановний Джейсон, Багато користувачів звертаються до нас зі скаргами щодо роботи нашого веб-сайту. Серед найпоширеніших проблем виокремлюються: Помилки, які виникають під час реєстрації або входу на сайт. Деякі користувачі стикаються з проблемами, пов'язаними з навігацією, що ускладнює їхню спробу знайти необхідну інформацію. Також ми отримали повідомлення про помилки, які виникають при виконанні певних операцій на сайті, таких як додавання товарів до кошика або оформлення замовлення. Крім того, деякі користувачі скаржаться на повільну роботу сайту, що ускладнює їхній взаємодії з ним. Потрібно терміново вжити заходів для вирішення цих проблем.",
    "Шановна Анна, Якщо ви бачите це повідомлення, це означає, що користувачі нашого сайту надіслали нам деякі проблеми, які потрібно вирішити. Серед них: проблеми з реєстрацією та входом на сайт, ускладнення навігації нашим сайтом, виявлення помилок під час виконання операцій, а також повільна робота нашого сайту. Ці проблеми перешкоджають нашим користувачам насолоджуватися повноцінним досвідом використання нашого сервісу. Ми робимо все можливе, щоб якнайшвидше вирішити ці проблеми та запропонувати нашим користувачам найкращий сервіс.",
    "Агато користувачів звертаються до нас зі скаргами щодо роботи нашого веб-сайту. Серед найпоширеніших проблем виокремлюються: Помилки, які виникають під час реєстрації або входу на сайт. Деякі користувачі стикаються з проблемами, пов'язаними з навігацією, що ускладнює їхню спробу знайти необхідну інформацію. Також ми отримали повідомлення про помилки, які виникають при виконанні певних операцій на сайті, таких як додавання товарів до кошика або оформлення замовлення. Крім того, деякі користувачі скаржаться на повільну роботу сайту, що ускладнює їхній взаємодії з ним. Потрібно терміново вжити заходів для вирішення цих проблем.",
    "На сайті виникають проблеми з реєстрацією та входом, у навігації, а також при виконанні певних операцій. Деякі користувачі також скаржаться на повільну роботу ресурсу. Ці недоліки перешкоджають користувачам отримати повноцінний досвід використання сайту.",
    "Користувачі виявляють складнощі під час реєстрації та входу на сайт.",
    "Навігація на сайті виявляється заплутаною для багатьох користувачів.",
    "Під час виконання певних операцій на сайті виникають непередбачені помилки.",
    "Деякі функції сайту працюють некоректно або не виконуються зовсім.",
    "Багато користувачів відзначають повільну роботу сайту, що ускладнює їхнє користування.",
    "Сайт не оптимізований для мобільних пристроїв, що ускладнює доступ до контенту для мобільних користувачів.",
    "Повідомлення про помилки на сайті не інформативні, що ускладнює їх виправлення користувачами.",
    "Сайт не забезпечує безпеку даних користувачів, що може призвести до витоку конфіденційної інформації.",
    "Деякі функції сайту працюють тільки в певних браузерах, що обмежує вибір користувача.",
    "Багато користувачів натрапляють на проблеми з відображенням контенту на сайті в різних роздільностях екрану."
]


class Command(BaseCommand):
    help = 'Seed random issue requests'

    def handle(self, *args, **kwargs):
        try:
            users = get_user_model().objects.all()
            for _ in range(30):
                user = choice(users)
                request = IssueRequest(
                    user=user,
                    text=choice(issues_list)
                )
                request.full_clean()
                request.save()
            self.stdout.write(self.style.SUCCESS("Запити повідомлення про помилку успішно створені!"))
        except Exception as e:
            self.stdout.write(self.style.ERROR(f"Помилка: {e}. Запити на повідомлення про помилку не створені"))
